var data = [];
var dataStr = '1、活着<br>\
<br>\
我们都活着，行尸走肉或好高骛远，都是一种生活，<br>\
从繁华阅尽到安于现状，活着，是唯一的藉口和安慰。<br>\
张艺谋44岁执导的《活着》让我们重看历史，<br>\
犹如一场旧梦，人命在历史的洪流中，貌似一场笑话，生命的轨迹，<br>\
没有圆点，只有一次次无可奈何的苟且。<br>\
<br>\
<br>\
2、霸王别姬<br>\
<br>\
所谓的“霸王别姬”，虞姬是中心，<br>\
而霸王只是附属，虞姬是“真虞姬”，<br>\
而霸王却是“假霸王”。<br>\
<br>\
<br>\
3、卧虎藏龙<br>\
<br>\
俗世的幸福在于敢于接受平凡，<br>\
有能力在平凡琐碎日复一日的人生里创造浪漫。<br>\
这是追求得道的李慕白不曾达到的境界。<br>\
是渴望平静的俞秀莲未曾获得的日子。<br>\
是血里有风的玉娇龙绝对不能接受的惨淡。<br>\
却也是大多数人世痛苦的解药。<br>\
<br>\
<br>\
4、重庆森林<br>\
<br>\
不知道从什么时候开始，在什么东西上面都有个日期，<br>\
秋刀鱼会过期，肉罐头会过期，连保鲜纸都会过期，我开始怀疑，<br>\
在这个世界上，还有什么东西是不会过期的？<br>\
终于在一家便利店，让我找到第30罐凤梨罐头。<br>\
就在5月1号的早晨，我开始明白一件事情，<br>\
在阿May的心中，我和这个凤梨罐头没有什么分别。<br>\
<br>\
<br>\
5、天下无贼<br>\
<br>\
每一个人都各怀心事，在欲望和权利的漩涡中挣扎，<br>\
在善和恶的悬崖边游走。人心真是个奇怪的东西，<br>\
谁敢说自己的心里没有一个“贼”。<br>\
<br>\
<br>\
6、山楂树之恋<br>\
<br>\
开红花的山楂树，正是老三悲剧性命运的象征。<br>\
他与山楂树是两体同命，而且比它更不幸。同样是被改变了基因，<br>\
山楂树开出红花，被当成革命象征为人颂扬，<br>\
而老三则只能眼看着自己一步步地丧失理智，<br>\
终于变成一个异类，被军队控制直到临终。<br>\
<br>\
<br>\
7、百鸟朝凤<br>\
<br>\
哪怕是影片最后，<br>\
官方机构来找到游长鸣录制唢呐班，<br>\
让我们以为唢呐班可能会有一丝回暖的迹象，<br>\
也被现实击的粉碎，<br>\
被城市化和工业化压榨的农民工们已经失去了回家乡生活的能力。<br>\
有些东西过去了就是过去了，<br>\
唢呐也许以后就只能存在于影像和人们的记忆当中。<br>\
<br>\
<br>\
8、芳华<br>\
<br>\
我们总是期望善良的人能收获美满，<br>\
可现实有时却难如人愿，<br>\
但即便这个世界并没有用温柔善待于你，<br>\
我们却并不应该失去这种弥足珍贵的本性，<br>\
因为芳华易逝，善良永驻。<br>\
<br>\
<br>\
9、天水围的日与夜<br>\
<br>\
天水围并非充斥着无处诉说的悲苦与哀愁，<br>\
跟香港其他地方乃至普通中国人的生活相比，<br>\
那里的人们没有什么不同。<br>\
<br>\
<br>\
10、城南旧事<br>\
<br>\
一个小女孩用清澈的眼眸看世界，<br>\
不得不让心沉浸在她心灵的童年里，<br>\
也一直沉浸在自己心灵中的童年中……<br>\
唤醒了那五光十色、朦胧而又耀眼的斑斓。<br>\
<br>\
<br>\
11、乘风破浪<br>\
<br>\
真正的忘记是不经意发生的，<br>\
是不需要努力的。回想起当初<br>\
我们心里的情绪就是《乘风破浪》音乐里的平静和舒缓，<br>\
而不是慷慨激昂，<br>\
当初再闹再傻也可以一笑置之了，<br>\
时间可以让所有的激情趋于冷静。<br>\
<br>\
<br>\
12、等风来<br>\
<br>\
不要着急，等风来！<br>\
等树林随风摇动的那一刻，<br>\
每个人都顺利飞上了天空。<br>\其实，生活也好，爱情也罢，<br>\
其实每个人的都不用着急做出任何决定。<br>\
当站在人生的悬崖，不如先不要动，<br>\
不要向前冲，要做的或许只是静静的，等风来。<br>\
<br>\
<br>\
13、一个都不能少<br>\
<br>\
也许是过于喧嚣的都市使越来越多的人渴望一丝清凉的慰藉，<br>\
也许是太多激情泛滥的“快餐式爱情”使得人们在银幕前日趋麻木，<br>\
也许是平日学习和工作的竞争压力使人们变成“现实主义者”。<br>\
<br>\
<br>\
14、盲道<br>\
<br>\
一个中国人被砍头，<br>\
周围围观的中国人面目麻木没有感情，<br>\
甚至有的中国人拍手叫好，<br>\
没有丝毫觉得被杀之人是自己的同胞，很是麻木不仁<br>\
<br>\
<br>\
15、红海行动<br>\
<br>\
战争并不像是其他电影里描述的那样，<br>\
举着五星红旗、喊着口号，<br>\
靠着主角光环，就能耍着帅击退敌人。<br>\
很多时候，这一仗打得好看不好看？<br>\
结果是输是赢？这些都不重要。<br>\
重要的是无论身处怎样的险境，<br>\
你的心里是否依旧坚定的怀有一种勇往无前的自豪与信念。<br>\
';
var d=dataStr.split('<br><br><br>');
for (var i=0;i<d.length;i++){
    var c=d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、',' ')+'.jpg',
        caption:c[0].split('、')[1],
        desc:c[1]
    });
    // console.log(data[i].caption);
}
// <br>\
// <br>\
// 16、鬼子来了<br>\
// <br>\
// 在你在观看影片的过程中发出“中国人懦弱、愚蠢、不可救药”这样的感叹时，请不要忘记你就是这懦弱、愚蠢、不可救药的中国人中的一个。 
// <br>\
// <br>\
// 17、阳光灿烂的日子<br>\
// <br>\
// 当我们走完少年时光，曾经快乐戏水的游泳池骤然变得恐怖，带给我们溺水般的慌乱和绝望。那些曾让我们幸福沉溺的，最终将我们淹没。
// <br>\
// <br>\
// 18、战狼<br>\
// <br>\
// 真正的青春就该歌颂勇气和爱，该歌颂对自我的寻找，要在人性趋利避害的恶里曲曲折折的开出一朵花来。
// <br>\
// <br>\
// 19、无问西东<br>\
// <br>\
//真正的青春就该歌颂勇气和爱，该歌颂对自我的寻找，要在人性趋利避害的恶里曲曲折折的开出一朵花来。
// <br>\
// <br>\
// 20、20<br>\
// <br>\
// ·当人们做不到一些事情的时候，他们就会对你说你也同样不能。<br>\
// ·如果你有梦想的话，就要去捍卫它。<br>\
// ·当你最认为困难的时候，其实就是你最接近成功的时候。<br>\
// ·以后连朋友都不做了？ ---没法儿做，太相爱的人怎么做朋友<br>\
// ·机会总是留给有准备的人，但那往往是努力的人剩下来的。<br>\